In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
url = "https://raw.githubusercontent.com/justmarkham/DAT8/master/data/chipotle.tsv"

In [3]:
# read the above file
df = pd.read_csv(url, sep = '\t')

In [4]:
# print first 5 and last 7 records

In [5]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [6]:
df.tail(7)

,order_id,quantity,item_name,choice_description,item_price
4615,1832,1,Chicken Soft Tacos,"[Fresh Tomato Salsa, [Rice, Cheese, Sour Cream]]",$8.75
4616,1832,1,Chips and Guacamole,NaN,$4.45
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [7]:
#print total records and type of variables

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [9]:
# print the name of all columns

In [11]:
df.columns

Index(['order_id', 'quantity', 'item_name', 'choice_description',
       'item_price'],
      dtype='object')

In [12]:
# how is the dataset indexed?

In [13]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [14]:
# Which was the most ordered item? and How many items were ordered?

In [30]:
c = df.groupby("item_name")
c = c.sum()
c = c.sort_values(['quantity'],ascending =  False)
c.head(1)

              order_id  quantity
item_name
Chicken Bowl    713926       761

In [41]:
c = df.groupby("item_name").sum().sort_values(['quantity'], ascending = False).head(1)

In [42]:
c

              order_id  quantity
item_name
Chicken Bowl    713926       761

In [43]:
#What was the most ordered item in the choice_description column?

In [56]:
c = df.groupby('choice_description').sum().sort_values(['quantity'] , ascending = False).head(1)

In [57]:
c

                    order_id  quantity
choice_description
[Diet Coke]           123455       159

In [58]:
#Turn the item_price into float

In [59]:
dollar = lambda x: float(x[1:-1])
df.item_price = df.item_price.apply(dollar)